# Demo Commands

This document demonstrates the basic demo commands available in Xanadu.

## Echo Command

The `echo` command prints text to the output:

```xanadu
> echo "hello world"
hello world
```

You can echo any text:

```xanadu
> echo "Hello, Xanadu!"
Hello, Xanadu!
```

## Add Command

The `add` command adds two numbers:

```xanadu
> add 1 2
3
```

More examples:

```xanadu
> add 50 50
100
> add 0 0
0
> add -5 10
5
```

## Combined Example

```xanadu
> echo "The result is:"
The result is:
> add 42 58
100
```
